Ran Plan for 2 projects:

1. project: `eks` dir: `terraform/eks` workspace: `default`
1. project: `apps` dir: `terraform/apps` workspace: `default`
---

### 1. project: `eks` dir: `terraform/eks` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster.this: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=my-cluster]
data.aws_eks_cluster.this: Read complete after 0s [id=my-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-west-1:524349720209:access-entry/my-cluster/user/524349720209/admin/38cb6f72-9f03-5126-c90d-6c65d3d90096" -> (known after apply)
      ~ created_at        = "2025-05-17T15:38:07Z" -> (known after apply)
      ~ id                = "my-cluster:arn:aws:iam::524349720209:user/admin" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-05-17T15:38:07Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role" # forces replacement
        tags              = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
      ~ user_name         = "arn:aws:iam::524349720209:user/admin" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-05-17 15:38:08.684 +0000 UTC" -> (known after apply)
      ~ id            = "my-cluster#arn:aws:iam::524349720209:user/admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-17 15:38:08.684 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
~ resource "aws_kms_key" "this" {
        id                                 = "d2277b64-dd85-4e4d-a5be-f6969001412e"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::524349720209:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::524349720209:role/my-cluster-cluster-20250517152832867100000004"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Terraform"             = "true"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p eks
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://k8s-default-atlantis-c37c062d85-2123044952.eu-west-1.elb.amazonaws.com/lock?id=velychkov%252Fatlantis%252Fterraform%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p eks
  ```
Plan: 2 to add, 1 to change, 2 to destroy.

---
### 2. project: `apps` dir: `terraform/apps` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.0 plan -input=false -refresh -out "/atlantis-data/repos/velychkov/atlantis/2/default/terraform/apps/apps-default.tfplan" -var-file=env/dev.tfvars' in '/atlantis-data/repos/velychkov/atlantis/2/default/terraform/apps': exit status 1
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.eks: Read complete after 1s
data.aws_iam_openid_connect_provider.oidc_issuer_url: Reading...
data.aws_eks_cluster.this: Reading...
data.aws_eks_cluster_auth.this: Reading...
data.aws_iam_openid_connect_provider.oidc_provider_arn: Reading...
aws_iam_policy.karpenter_policy: Refreshing state... [id=arn:aws:iam::524349720209:policy/karpenterIampolicy]
aws_iam_policy.alb_ingress_policy: Refreshing state... [id=arn:aws:iam::524349720209:policy/AWSLoadBalancerControllerIAMPolicy]
data.aws_eks_cluster_auth.this: Read complete after 0s [id=my-cluster]
data.aws_eks_cluster.this: Read complete after 0s [id=my-cluster]
data.aws_iam_openid_connect_provider.oidc_provider_arn: Read complete after 0s [id=arn:aws:iam::524349720209:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/B735A2BBDBF7B0E2480D602A78FEFE64]
data.aws_iam_openid_connect_provider.oidc_issuer_url: Read complete after 0s [id=arn:aws:iam::524349720209:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/B735A2BBDBF7B0E2480D602A78FEFE64]
data.aws_iam_policy_document.karpenter: Reading...
data.aws_iam_policy_document.alb_ingress: Reading...
data.aws_iam_policy_document.eks_assume_role_read_only: Reading...
data.aws_iam_policy_document.eks_assume_role_admin: Reading...
helm_release.atlantis: Refreshing state... [id=atlantis]
data.aws_iam_policy_document.karpenter: Read complete after 0s [id=1276076488]
data.aws_iam_policy_document.eks_assume_role_read_only: Read complete after 0s [id=2225590153]
data.aws_iam_policy_document.alb_ingress: Read complete after 0s [id=1287474383]
data.aws_iam_policy_document.eks_assume_role_admin: Read complete after 0s [id=421162351]
aws_iam_role.karpenter: Refreshing state... [id=karpenter]
aws_iam_role.alb_ingress: Refreshing state... [id=alb-ingress-controller]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin-role]
aws_iam_role.eks_read_only: Refreshing state... [id=eks-read-only-role]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-role-20250518172948632200000001]
kubernetes_service_account.eks_admin_sa: Refreshing state... [id=default/eks-admin]
kubernetes_service_account.alb_sa: Refreshing state... [id=kube-system/aws-load-balancer-controller]
kubernetes_service_account.eks_read_only_sa: Refreshing state... [id=default/eks-read-only]
aws_iam_role_policy_attachment.eks_read_only_attach: Refreshing state... [id=eks-read-only-role-20250518172948717100000003]
aws_iam_role_policy_attachment.alb_ingress_attach: Refreshing state... [id=alb-ingress-controller-20250518172948638800000002]
aws_iam_role_policy_attachment.karpenter_worker: Refreshing state... [id=karpenter-20250519150130222400000002]
aws_iam_role_policy_attachment.karpenter_custom: Refreshing state... [id=karpenter-20250519184754793300000001]
aws_iam_role_policy_attachment.karpenter_ecr: Refreshing state... [id=karpenter-20250519150130396600000003]
aws_iam_role_policy_attachment.karpenter_ssm: Refreshing state... [id=karpenter-20250519150130040900000001]
helm_release.karpenter: Refreshing state... [id=karpenter]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Kubernetes cluster unreachable: Get "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/version": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with helm_release.atlantis,
│   on atlantis.tf line 1, in resource "helm_release" "atlantis":
│    1: resource "helm_release" "atlantis" {
│ 
╵
╷
│ Error: Kubernetes cluster unreachable: Get "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/version": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with helm_release.karpenter,
│   on karpenter.tf line 1, in resource "helm_release" "karpenter":
│    1: resource "helm_release" "karpenter" {
│ 
╵
╷
│ Error: Invalid configuration for API client
│ 
│   with kubernetes_manifest.karpenter_nodepool,
│   on karpenter.tf line 29, in resource "kubernetes_manifest" "karpenter_nodepool":
│   29: resource "kubernetes_manifest" "karpenter_nodepool" {
│ 
│ Get
│ "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/apis":
│ getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is
│ not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
╵
╷
│ Error: Get "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/api/v1/namespaces/kube-system/serviceaccounts/aws-load-balancer-controller": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with kubernetes_service_account.alb_sa,
│   on sa.tf line 1, in resource "kubernetes_service_account" "alb_sa":
│    1: resource "kubernetes_service_account" "alb_sa" {
│ 
╵
╷
│ Error: Get "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/api/v1/namespaces/default/serviceaccounts/eks-admin": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with kubernetes_service_account.eks_admin_sa,
│   on sa.tf line 12, in resource "kubernetes_service_account" "eks_admin_sa":
│   12: resource "kubernetes_service_account" "eks_admin_sa" {
│ 
╵
╷
│ Error: Get "https://B735A2BBDBF7B0E2480D602A78FEFE64.gr7.eu-west-1.eks.amazonaws.com/api/v1/namespaces/default/serviceaccounts/eks-read-only": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with kubernetes_service_account.eks_read_only_sa,
│   on sa.tf line 22, in resource "kubernetes_service_account" "eks_read_only_sa":
│   22: resource "kubernetes_service_account" "eks_read_only_sa" {
│ 
╵


```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```